const gifts = [
  ["tip_30", "薯條", 30],
  ["tip_45", "雞米花", 45],
  ["tip_50", "洋蔥圈", 50],
  ["tip_100", "雞排", 100],
  ["tip_250", "天婦羅套餐", 250],
  ["tip_380", "咬你一口蛋糕", 380],
  ["tip_520", "黑森林蛋糕", 520],
  ["tip_666", "漂白洗刷套餐", 666],
  ["tip_888", "水蜜桃禮盒", 888],
  ["tip_1688", "滿滿的愛", 1688, "1688 ASD｜可全體廣播"],
  [
    "tip_1999",
    "明燈千里",
    1999,
    "1999 ASD｜可全體廣播，冠名三天，陪陪專屬語音感謝",
  ],
  ["tip_16888", "明燈三千盞", 16888, "16888 ASD｜詳情請詢問客服"],
];

module.exports = gifts.map(([key, name, price, description]) => ({
  key,
  name,
  price,
  description: description || `${price} ASD`,
}));
